# HasObjStoryBounds

## Description
Determine if the object has any story bounds.

```pascal
FUNCTION HasObjStoryBounds(obj : HANDLE): BOOLEAN;
```

```python
def vs.HasObjStoryBounds(obj):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|obj|HANDLE|The object.|

## See Also
VS Functions:
HasObjStoryBounds
| HasObjStoryBound
| GetObjStoryBound
| SetObjectStoryBound
| DelObjStoryBounds
| DelObjStoryBound
| GetObjStoryBoundsCnt
| GetObjStoryBoundsAt

## Version
Availability: from Vectorworks 2012

## Category
* Objects - Architectural